using System;
using System.Collections;
using System.Collections.Generic;

namespace ItProger
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*Создайте программу, которая будет принимать число (n), введенное 
             * пользователем, и выдавать результат в виде (n + n * 2).



            Пример:

            // Вводим 23
            // Получаем: 2346*/

            /*// Получаем число от пользователя
            int n1 = int.Parse(Console.ReadLine());
            // Вторая переменная содержит число от пользователя, умноженное на два
            int n2 = n1 * 2;
            // Выводим их вместе
            // превращаем в строки, чтобы не добавлялись
            Console.Write(n1.ToString() + n2.ToString());
            
           Создайте переменные для хранения следующий значений:
            -34, 4, 'Hello', 'R', 23.093433222, 30000, true, 0. 



            Продумайте типы данных для переменных, чтобы они максимально подходили под 
            каждое значение.
             
             */


            // Маленькое число, поэтому byte
            byte num1 = 34;
            byte num2 = 4;
            // Строка
            string word = "Hello";
            // Символ
            char sym = 'R';
            // Много чисел после запятой, поэтому double
            double num33 = 23.093433222f;
            // Чуть больше число, поэтому short
            short number = 30000;
            // Булевое выражение
            bool val = true;
            // Байтовая переменная
            byte simple = 0;






        }

    }
}

    
